# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a  0.646786  0.105320  1.966424
c -1.273212  0.126146 -0.806349
e -0.518875 -0.368488 -0.933819
f  1.615219  1.411242 -0.390727
h -0.344953  0.832735 -0.116896

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [3]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a  0.646786  0.105320  1.966424  bar   True
c -1.273212  0.126146 -0.806349  bar  False
e -0.518875 -0.368488 -0.933819  bar  False
f  1.615219  1.411242 -0.390727  bar   True
h -0.344953  0.832735 -0.116896  bar  False

Adding new rows is also simple. Below we include three extra empty rows:

In [4]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a  0.646786  0.105320  1.966424  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -1.273212  0.126146 -0.806349  bar  False
d       NaN       NaN       NaN  NaN    NaN
e -0.518875 -0.368488 -0.933819  bar  False
f  1.615219  1.411242 -0.390727  bar   True
g       NaN       NaN       NaN  NaN    NaN
h -0.344953  0.832735 -0.116896  bar  False

# Your Turn Here

Do you still remember how to index a row/column?

In [7]:
#### index row 'c' below
df.loc['c']

one      -1.27321
two      0.126146
three   -0.806349
four          bar
five        False
Name: c, dtype: object

In [19]:
#### index column 'two' below
df.loc[:,'two']

a    0.105320
c    0.126146
e   -0.368488
f    1.411242
h    0.832735
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [20]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [21]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [34]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

        one       two
a       NaN  0.105320
c       NaN  0.126146
e       NaN -0.368488
f  1.615219  1.411242
h -0.344953  0.832735

In [35]:
b = df[['one','two','three']]
b

        one       two     three
a  0.646786  0.105320  1.966424
c -1.273212  0.126146 -0.806349
e -0.518875 -0.368488 -0.933819
f  1.615219  1.411242 -0.390727
h -0.344953  0.832735 -0.116896

In [36]:
a + b

        one  three       two
a       NaN    NaN  0.210641
c       NaN    NaN  0.252291
e       NaN    NaN -0.736976
f  3.230439    NaN  2.822484
h -0.689906    NaN  1.665470

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [37]:
a['one'].dropna()

f    1.615219
h   -0.344953
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [38]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a  0.105320
c  0.126146
e -0.368488
f  1.411242
h  0.832735

In [39]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN  0.210641
c       NaN  0.252291
e       NaN -0.736976
f  3.230439  2.822484
h -0.689906  1.665470

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [40]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN  0.210641
c       NaN  0.252291
e       NaN -0.736976
f  3.230439  2.822484
h -0.689906  1.665470

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [41]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [42]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [43]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [44]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [51]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a  0.793456 -0.213059 -0.661236
b  1.283138  1.131444  0.844442
c       NaN       NaN -0.513492
d -0.090676 -0.863328  0.308978
e       NaN  0.220970  1.072547

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [52]:
#### insert your code here

rand_df['one']=rand_df['one'].fillna(1)
rand_df['two']=rand_df['two'].fillna(method='ffill')
rand_df['three']=rand_df['three'].fillna(method='bfill')
rand_df

        one       two     three
a  0.793456 -0.213059 -0.661236
b  1.283138  1.131444  0.844442
c  1.000000  1.131444 -0.513492
d -0.090676 -0.863328  0.308978
e  1.000000  0.220970  1.072547

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [53]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a  1.811553 -0.735607  0.564311
b -0.962914 -0.995733 -0.869256
c       NaN -0.441584       NaN
d  0.137858       NaN  0.960950
e -1.021728 -0.419386  0.455694

In [54]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [55]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A   -0.008808
B   -0.648078
C    0.277925
dtype: float64

In [56]:
df_filled = my_df.fillna(my_df.mean())
df_filled

          A         B         C
a  1.811553 -0.735607  0.564311
b -0.962914 -0.995733 -0.869256
c -0.008808 -0.441584  0.277925
d  0.137858 -0.648078  0.960950
e -1.021728 -0.419386  0.455694

In [57]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.